{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 2580, 1]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"strides": [1], "activity_regularizer": null, "padding": "valid", "use_bias": true, "kernel_size": [15], "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "filters": 16, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "conv1d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [6], "pool_size": [6], "name": "max_pooling1d_1", "trainable": true}, "name": "max_pooling1d_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"strides": [1], "activity_regularizer": null, "padding": "valid", "use_bias": true, "kernel_size": [5], "name": "conv1d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "conv1d_2", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [5], "pool_size": [5], "name": "max_pooling1d_2", "trainable": true}, "name": "max_pooling1d_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"strides": [1], "activity_regularizer": null, "padding": "valid", "use_bias": true, "kernel_size": [3], "name": "conv1d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "conv1d_3", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [4], "pool_size": [4], "name": "max_pooling1d_3", "trainable": true}, "name": "max_pooling1d_3", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"strides": [1], "activity_regularizer": null, "padding": "valid", "use_bias": true, "kernel_size": [3], "name": "conv1d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "conv1d_4", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [3], "pool_size": [3], "name": "max_pooling1d_4", "trainable": true}, "name": "max_pooling1d_4", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"units": 7, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}